# Binaries
brew 'bash' # Latest Bash version
brew 'bat' # Used for spatie/visit
brew 'coreutils' # Those that come with macOS are outdated
brew 'ffmpeg'
brew 'gh'
brew 'git'
brew 'grep'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'tree'
brew 'nmap' # For checking open ports

# Development
brew 'imagemagick'

# Apps
cask 'caffeine'                # Keep Mac awake
cask 'firefox'                 # Web browser
cask 'rectangle'               # Window management
cask 'vlc'                     # Media player
cask 'appcleaner'              # Uninstall apps
cask 'iterm2'                  # Terminal replacement
cask 'stremio'                 # Streaming service
cask 'pastebot'                # Clipboard manager
cask 'reflex'                  # Live reload for web development
cask 'beekeeper-studio'        # MySQL and Postgres GUI
cask 'the-unarchiver'          # Archive extractor
cask 'visual-studio-code'      # Code editor
cask 'docker'                  # Docker for Mac
cask 'mullvad-vpn'             # VPN service
cask 'termius'                 # SSH client
cask 'zoom'                    # Video conferencing
cask 'tailscale'               # VPN service
cask 'windows-app'             # Microsoft Windows
# cask 'wireshark'               # Network protocol analyzer
# cask 'transmit'                # FTP client
# cask 'imageoptim'             # Image optimizer
# cask 'screen-studio'          # Screen recording
# cask 'slack'                 # Team communication
# cask 'tuple'                  # Pair programming

# Quicklook
cask 'qlmarkdown'
cask 'quicklook-json'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
# cask 'font-source-sans-pro'
# cask 'font-source-serif-pro'

# Mac App Store
mas 'Shazam', id: 897118787
mas 'Amperfy Music', id: 1530145038
mas 'Evermusic', id: 1530145038

